from .database import SessionLocal
from .models import *

# User region ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

async def add_user(surname, name, email, phone, password):
    session = SessionLocal()  # Создание сессии, предполагается, что Session уже определен, как в предыдущем примере
    new_user = User(surname=surname, name=name, email=email, phone=phone, password=password)
    try:
        session.add(new_user)  # Добавление нового пользователя в сессию
        session.commit()  # Фиксация изменений в базе данных
        print(f"Пользователь {name} {surname} успешно добавлен.")
        return new_user  # Возвращаем объект пользователя после успешного добавления
    except Exception as e:
        session.rollback()  # Откат изменений в случае ошибки
        print(f"Ошибка при добавлении пользователя: {e}")
    finally:
        session.close()  # Закрытие сессии

# Пример использования функции
# add_user('Иванов', 'Иван', 'ivan@example.com', '89123456789', 'securepassword123')

# Admin region ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
# etc